src/slides/00-abertura.org
#+TITLE: Abertura e Alinhamento
#+AUTHOR: Lucas S. Vieira
#+SUBTITLE: Introdução à IA Generativa
#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js@4/
#+REVEAL_THEME: night
#+REVEAL_PLUGINS: (highlight)
#+REVEAL_MARGIN: 0.1
#+REVEAL_MIN_SCALE: 0.5
#+REVEAL_MAX_SCALE: 2.0
#+OPTIONS: toc:nil num:nil
#+REVEAL_TITLE_SLIDE: <p style="font-size:0.7em;opacity:0.6;">%a</p><br/><h2>%t</h2><br/><p style="font-size:0.85em;opacity:0.8;">%s</p><br/><p style="font-size:0.9em;color:#FFB033;">Guilda de IA</p>
#+REVEAL_TITLE_SLIDE_BACKGROUND: ./slide_00.gif

* O que é a Guilda de IA?

#+ATTR_REVEAL: :frag (appear)
- Grupo de estudo sobre IA Generativa
- Foco em *construir agentes*
- Da teoria à prática
- 12 semanas de conteúdo
- *Material estruturado com ajuda do Hermes Agent* (meu assistente de IA!)

* Plano do Curso

#+ATTR_REVEAL: :frag (appear)
| Semana | Data | Tema |
|--------+------+------|
| 00 | 10/04 | Abertura (hoje) |
| 01 | 17/04 | O que é IA hoje? |
| 02 | 24/04 | Prompting básico |
| 03 | 08/05 | Python mínimo |
| 04 | 15/05 | Python + API de LLM |
| 05 | 22/05 | Estrutura de um agente |

#+REVEAL: split
| Semana | Data | Tema |
|--------+------+------|
| 06 | 29/05 | Primeira ferramenta |
| 07 | 05/06 | Ferramentas múltiplas |
| 08 | 12/06 | Embeddings e similaridade |
| 09 | 19/06 | RAG |
| 10 | 26/06 | Desenvolvimento livre |
| 11 | 03/07 | Apresentação final |

* Forma de Avaliação

#+ATTR_REVEAL: :frag (appear)
1. *Presença* nas aulas
2. *Participação* nas atividades
3. *Projeto final:* agente funcionando (semana 11)

#+ATTR_REVEAL: :frag (appear)
#+begin_quote
Foco em aprender, não em nota.
#+end_quote

* Materiais Didáticos

#+ATTR_REVEAL: :frag (appear)
- *Site:* https://luksamuk.codes/pages/guilda-ia
- *Google Colab:* para rodar código (sem instalar nada)

#+ATTR_REVEAL: :frag (appear)
#+begin_quote
Tudo no navegador. Zero instalação.
#+end_quote

* APIs Gratuitas

#+ATTR_REVEAL: :frag (appear)
- *Google Gemini:* 1M tokens/dia
  - aistudio.google.com
  - API key gratuita
  
#+ATTR_REVEAL: :frag (appear)
- *HuggingFace:* modelos open-source
  - huggingface.co
  - Inference API gratuita

- *OpenRouter:* agregador de modelos
  - openrouter.ai
  - Crédito inicial gratuito
  - Modelos gratuitos (:free)

* Demonstrações

** Interfaces Web

#+ATTR_REVEAL: :frag (appear)
- *Gemini:* https://gemini.google.com/
- *HuggingChat:* https://huggingface.co/chat/
- *OpenRouter Chat:* https://openrouter.ai/chat/

#+ATTR_REVEAL: :frag (appear)
#+begin_quote
Teste online antes de programar!
#+end_quote

** Ollama

#+ATTR_REVEAL: :frag (appear)
- Roda modelos *localmente* na sua máquina
- Vamos usar o *Qwen3.5:4B* hoje
- Sem internet, sem API, sem custo

#+ATTR_REVEAL: :frag (appear)
#+BEGIN_SRC bash
ollama run qwen3.5:4b
#+END_SRC

#+ATTR_REVEAL: :frag (appear)
#+BEGIN_SRC bash
kitty icat ./japanese.png && \
ollama run qwen3.5:4b "Transcreva o texto e depois traduza o texto para Português: ./japanese.jpg" --think=false
#+END_SRC

** Open WebUI

#+ATTR_REVEAL: :frag (appear)
- Interface web local customizável
- Conecta seus modelos e chaves de API
- [[http://localhost:3111][Roda localmente (para mim!)]]

#+ATTR_REVEAL: :frag (appear)
#+begin_quote
No meu caso, uso apenas para Ollama.
#+end_quote

** LM Studio

#+ATTR_REVEAL: :frag (appear)
- Interface gráfica para modelos locais
- Vamos ver o *Gemma 4 E2B* (roda em celular!)
- Alternativa fácil para quem não quer terminal

#+ATTR_REVEAL: :frag (appear)
- Site: https://lmstudio.ai/

** ask-ai no Terminal

#+ATTR_REVEAL: :frag (appear)
- Ferramenta que desenvolvi para uso pessoal
- Consulta múltiplas fontes de IA
- Interface simples no terminal

#+ATTR_REVEAL: :frag (appear)
#+BEGIN_SRC bash
ask ocr ./japanese.jpg | ask translate :br
#+END_SRC

#+ATTR_REVEAL: :frag (appear)
#+begin_quote
Vocês vão construir algo *ligeiramente* similar ao longo do curso.
#+end_quote

** Agentes de IA

#+ATTR_REVEAL: :frag (appear)
- *Claude Code* — agente de código da Anthropic
- *OpenCode* — alternativa open-source
- *Pi* — assistente conversacional
- *Hermes Agent* — assistente que me ajudou a criar este material!

* Perguntas e Expectativas

- O que vocês esperam aprender?
- Já usaram ChatGPT, Claude, Gemini?
- Alguém já programou?

* Para a próxima aula
:PROPERTIES:
:REVEAL_BACKGROUND: ./slide_00.gif
:END:

#+ATTR_REVEAL: :frag (appear)
- Explorar os serviços citados (Gemini, HuggingFace, OpenRouter)
- Ver qual você se adapta melhor
- Ou trazer serviços melhores que fornecem API de graça

#+ATTR_REVEAL: :frag (appear)
#+begin_quote
Cuidado com serviços que exigem cartão de crédito e cuidado com gastos descuidados!
#+end_quote