slides/00-abertura.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Abertura e Alinhamento</title>
<meta name="author" content="Lucas S. Vieira"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js@4/dist/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js@4/dist/theme/night.css" id="theme"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js@4/plugin/highlight/zenburn.css"/>
<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide" data-background="./slide_00.gif"><p style="font-size:0.7em;opacity:0.6;">Lucas S. Vieira</p><br/><h2>Abertura e Alinhamento</h2><br/><p style="font-size:0.85em;opacity:0.8;">Introdução à IA Generativa</p><br/><p style="font-size:0.9em;color:#FFB033;">Guilda de IA</p>
</section>
<section>
<section id="slide-org1c1d35e">
<h2 id="org1c1d35e">O que é a Guilda de IA?</h2>
<ul>
<li class="fragment appear">Grupo de estudo sobre IA Generativa</li>
<li class="fragment appear">Foco em <b>construir agentes</b></li>
<li class="fragment appear">Da teoria à prática</li>
<li class="fragment appear">12 semanas de conteúdo</li>
<li class="fragment appear"><b>Material estruturado com ajuda do Hermes Agent</b> (meu assistente de IA!)</li>

</ul>
</section>
</section>
<section>
<section id="slide-orgddec35b">
<h2 id="orgddec35b">Plano do Curso</h2>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" class="fragment (appear)">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Semana</th>
<th scope="col" class="org-left">Data</th>
<th scope="col" class="org-left">Tema</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">00</td>
<td class="org-left">10/04</td>
<td class="org-left">Abertura (hoje)</td>
</tr>

<tr>
<td class="org-right">01</td>
<td class="org-left">17/04</td>
<td class="org-left">O que é IA hoje?</td>
</tr>

<tr>
<td class="org-right">02</td>
<td class="org-left">24/04</td>
<td class="org-left">Prompting básico</td>
</tr>

<tr>
<td class="org-right">03</td>
<td class="org-left">08/05</td>
<td class="org-left">Python mínimo</td>
</tr>

<tr>
<td class="org-right">04</td>
<td class="org-left">15/05</td>
<td class="org-left">Python + API de LLM</td>
</tr>

<tr>
<td class="org-right">05</td>
<td class="org-left">22/05</td>
<td class="org-left">Estrutura de um agente</td>
</tr>
</tbody>
</table>

</section>
<section id="slide-orgddec35b-split">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Semana</th>
<th scope="col" class="org-left">Data</th>
<th scope="col" class="org-left">Tema</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">06</td>
<td class="org-left">29/05</td>
<td class="org-left">Primeira ferramenta</td>
</tr>

<tr>
<td class="org-right">07</td>
<td class="org-left">05/06</td>
<td class="org-left">Ferramentas múltiplas</td>
</tr>

<tr>
<td class="org-right">08</td>
<td class="org-left">12/06</td>
<td class="org-left">Embeddings e similaridade</td>
</tr>

<tr>
<td class="org-right">09</td>
<td class="org-left">19/06</td>
<td class="org-left">RAG</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-left">26/06</td>
<td class="org-left">Desenvolvimento livre</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-left">03/07</td>
<td class="org-left">Apresentação final</td>
</tr>
</tbody>
</table>
</section>
</section>
<section>
<section id="slide-orgdb34df6">
<h2 id="orgdb34df6">Forma de Avaliação</h2>
<ol>
<li class="fragment appear"><b>Presença</b> nas aulas</li>
<li class="fragment appear"><b>Participação</b> nas atividades</li>
<li class="fragment appear"><b>Projeto final:</b> agente funcionando (semana 11)</li>

</ol>

<blockquote  class="fragment (appear)">
<p>
Foco em aprender, não em nota.
</p>
</blockquote>
</section>
</section>
<section>
<section id="slide-org5ba02f0">
<h2 id="org5ba02f0">Materiais Didáticos</h2>
<ul>
<li class="fragment appear"><b>Site:</b> <a href="https://luksamuk.codes/pages/guilda-ia">https://luksamuk.codes/pages/guilda-ia</a></li>
<li class="fragment appear"><b>Google Colab:</b> para rodar código (sem instalar nada)</li>

</ul>

<blockquote  class="fragment (appear)">
<p>
Tudo no navegador. Zero instalação.
</p>
</blockquote>
</section>
</section>
<section>
<section id="slide-org1a925c8">
<h2 id="org1a925c8">APIs Gratuitas</h2>
<ul>
<li class="fragment appear"><b>Google Gemini:</b> 1M tokens/dia
<ul>
<li>aistudio.google.com</li>
<li>API key gratuita</li>

</ul></li>

</ul>

<ul>
<li class="fragment appear"><b>HuggingFace:</b> modelos open-source
<ul>
<li>huggingface.co</li>
<li>Inference API gratuita</li>

</ul></li>

<li class="fragment appear"><b>OpenRouter:</b> agregador de modelos
<ul>
<li>openrouter.ai</li>
<li>Crédito inicial gratuito</li>
<li>Modelos gratuitos (:free)</li>

</ul></li>

</ul>
</section>
</section>
<section>
<section id="slide-org2d5af1b">
<h2 id="org2d5af1b">Demonstrações</h2>
<div class="outline-text-2" id="text-org2d5af1b">
</div>
</section>
<section id="slide-org230bcbc">
<h3 id="org230bcbc">Interfaces Web</h3>
<ul>
<li class="fragment appear"><b>Gemini:</b> <a href="https://gemini.google.com/">https://gemini.google.com/</a></li>
<li class="fragment appear"><b>HuggingChat:</b> <a href="https://huggingface.co/chat/">https://huggingface.co/chat/</a></li>
<li class="fragment appear"><b>OpenRouter Chat:</b> <a href="https://openrouter.ai/chat/">https://openrouter.ai/chat/</a></li>

</ul>

<blockquote  class="fragment (appear)">
<p>
Teste online antes de programar!
</p>
</blockquote>
</section>
<section id="slide-org7df1987">
<h3 id="org7df1987">Ollama</h3>
<ul>
<li class="fragment appear">Roda modelos <b>localmente</b> na sua máquina</li>
<li class="fragment appear">Vamos usar o <b>Qwen3.5:4B</b> hoje</li>
<li class="fragment appear">Sem internet, sem API, sem custo</li>

</ul>

<div class="org-src-container">

<pre  class="fragment (appear)"  ><code class="bash" >ollama run qwen3.5:4b
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment (appear)"  ><code class="bash" >kitty icat ./japanese.png &amp;&amp; \
ollama run qwen3.5:4b "Transcreva o texto e depois traduza o texto para Português: ./japanese.jpg" --think=false
</code></pre>
</div>
</section>
<section id="slide-org34bdf34">
<h3 id="org34bdf34">Open WebUI</h3>
<ul>
<li class="fragment appear">Interface web local customizável</li>
<li class="fragment appear">Conecta seus modelos e chaves de API</li>
<li class="fragment appear"><a href="http://localhost:3111">Roda localmente (para mim!)</a></li>

</ul>

<blockquote  class="fragment (appear)">
<p>
No meu caso, uso apenas para Ollama.
</p>
</blockquote>
</section>
<section id="slide-orgb02c9c4">
<h3 id="orgb02c9c4">LM Studio</h3>
<ul>
<li class="fragment appear">Interface gráfica para modelos locais</li>
<li class="fragment appear">Vamos ver o <b>Gemma 4 E2B</b> (roda em celular!)</li>
<li class="fragment appear">Alternativa fácil para quem não quer terminal</li>

</ul>

<ul>
<li class="fragment appear">Site: <a href="https://lmstudio.ai/">https://lmstudio.ai/</a></li>

</ul>
</section>
<section id="slide-org0e85925">
<h3 id="org0e85925">ask-ai no Terminal</h3>
<ul>
<li class="fragment appear">Ferramenta que desenvolvi para uso pessoal</li>
<li class="fragment appear">Consulta múltiplas fontes de IA</li>
<li class="fragment appear">Interface simples no terminal</li>

</ul>

<div class="org-src-container">

<pre  class="fragment (appear)"  ><code class="bash" >ask ocr ./japanese.jpg | ask translate :br
</code></pre>
</div>

<blockquote  class="fragment (appear)">
<p>
Vocês vão construir algo <b>ligeiramente</b> similar ao longo do curso.
</p>
</blockquote>
</section>
<section id="slide-org9b61605">
<h3 id="org9b61605">Agentes de IA</h3>
<ul>
<li class="fragment appear"><b>Claude Code</b> — agente de código da Anthropic</li>
<li class="fragment appear"><b>OpenCode</b> — alternativa open-source</li>
<li class="fragment appear"><b>Pi</b> — assistente conversacional</li>
<li class="fragment appear"><b>Hermes Agent</b> — assistente que me ajudou a criar este material!</li>

</ul>
</section>
</section>
<section>
<section id="slide-org8289fcb">
<h2 id="org8289fcb">Perguntas e Expectativas</h2>
<ul>
<li>O que vocês esperam aprender?</li>
<li>Já usaram ChatGPT, Claude, Gemini?</li>
<li>Alguém já programou?</li>

</ul>
</section>
</section>
<section>
<section id="slide-orga226bc1" data-background="./slide_00.gif">
<h2 id="orga226bc1">Para a próxima aula</h2>
<ul>
<li class="fragment appear">Explorar os serviços citados (Gemini, HuggingFace, OpenRouter)</li>
<li class="fragment appear">Ver qual você se adapta melhor</li>
<li class="fragment appear">Ou trazer serviços melhores que fornecem API de graça</li>

</ul>

<blockquote  class="fragment (appear)">
<p>
Cuidado com serviços que exigem cartão de crédito e cuidado com gastos descuidados!
</p>
</blockquote>
</section>
</section>
</div>
</div>
<script src="https://cdn.jsdelivr.net/npm/reveal.js@4/dist/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js@4/plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } }]

});

</script>
</body>
</html>
